BTN_LEFT = 0
BTN_RIGHT = 1
BTN_UP = 2
BTN_DOWN = 3
BTN_O = 4
BTN_X = 5

BTN_COUNT = 6

BTN_PAUSE = -1

BTN_MAP = {
    [-1] = {"escape", "p", "return"},

    -- Player 1
    [0] = {"left"},
    [1] = {"right"},
    [2] = {"up"},
    [3] = {"down"},
    [4] = {"z", "c", "n"},
    [5] = {"x", "v", "m"},
    
    -- Player 2
    [6] = {"s"},
    [7] = {"f"},
    [8] = {"e"},
    [9] = {"d"},
    [10] = {"tab"},
    [11] = {"q"},
}

INPUT_STATE_OFF = 0
INPUT_STATE_PRESSING = 1 
INPUT_STATE_ON = 2
INPUT_STATE_RELEASING = 3

MAX_PLAYERS = 8

--                ▮■□⁙⁘‖◀▶「」¥•、。゛゜ !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~○█▒🐱⬇░✽●♥☉웃⌂⬅😐♪🅾◆…➡★⧗⬆ˇ∧❎▤▥あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんっゃゅょアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンッャュョ¡¿◜◝àáâãäåąæçćèéêëęìíîïłðñńòóôõöøùúûüśýźżœþßÀÁÂÃÄÅĄÆÇĆÈÉÊËĘÌÍÎÏŁÐÑŃÒÓÔÕÖØÙÚÛÜŚÝŹŻŒÞÿŸЁ
P8SCII_SYMBOLS = 
    "                ▮■□⁙⁘‖◀▶「」¥•、。゛゜ !\"#$%&'()*+,-./0123456789:;<=>?".. 
    "@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~".. 
    "○█▒🐱⬇░✽●♥☉웃⌂⬅😐♪🅾◆…➡★⧗⬆ˇ∧❎▤▥".. 
    "あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれ".. 
    "ろわをんっゃゅょアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメ"..
    "モヤユヨラリルレロワヲンッャュョ◜◝"..
    "¡¿"..
    "àáâãäåąæçćèéêëęìíîïłðñńòóôõöøùúûüśýźżœþß".. 
    "ÀÁÂÃÄÅĄÆÇĆÈÉÊËĘÌÍÎÏŁÐÑŃÒÓÔÕÖØÙÚÛÜŚÝŹŻŒÞÿŸЁ"..
    "中文返回模式键盘鼠标手柄开关继续重新始选项语言控制退出音效量全屏题画面随机试再玩一次"..
    "更换鸟类移动左右上下射击切武器游戏作编程美术乐鸽子鸭麻雀鹦鹉巨嘴火烈老鹰海鸥鸵企鹅松"..
    "鸦鸡轮枪烟花发拳套箭筒焰喷光环炮霰弹突步狙加特林药生命值车厢时间杀没了结束恭喜在按住"..
    "解锁困难你是认真的吗这个本来就不该能通"

FONT_HEIGHT = 6 -- 5 pixel high character + accounting for 1 pixel spacing below

LAYER_GAME = 1
LAYER_MENU = 2

-- ¡¿àáâãäåąæçćèéêëęìíîïłðñńòóôõöøùúûüśýźżœþß
-- ¡¿aaaaaaa.cceeeeeiiiil.nnoooooouuuusyzz...